app/Controllers/Admin.php

    public function index()
    {
        if(!$this->checkSession()){
            return redirect()->to('/login');
        };

        $builder = $this->db->table('pieteikumi');
        $builder->join('meistari', 'meistari.id = pieteikumi.meistara_id');
        $builder->join('pakalpojumi', 'pakalpojumi.id = pieteikumi.pakalpojuma_id');
        if(!$this->session->admin){
            $builder->where('meistari.id',$this->session->user_id);
        }
        $query   = $builder->orderBy('`timestamp`', 'DESC')->get();
---
SELECT *
FROM `meistari`
JOIN `pakalpojumi` ON `pakalpojumi`.`id` = `meistari`.`pakalpojuma_id`
SELECT *
FROM `pieteikumi`
JOIN `meistari` ON `meistari`.`id` = `pieteikumi`.`meistara_id`
JOIN `pakalpojumi` ON `pakalpojumi`.`id` = `pieteikumi`.`pakalpojuma_id`
ORDER BY `timestamp` DESC

    public function users(){
        // Meistaru saraksts
        if(!$this->checkSession()){
            return redirect()->to('/login');
        };
        $builder = $this->db->table('meistari');
        // $builder->join('meistari_pakalpojumi', 'meistari_pakalpojumi.meistars_id = meistari.id','inner')->join('pakalpojumi','meistari_pakalpojumi.Pakalpojumi_id = pakalpojumi.id','inner');
        $query   = $builder->get();
---
SELECT *
FROM `meistari`

    public function services(){
        // Pakalpojumu saraksts
        if(!$this->checkSession()){
            return redirect()->to('/login');
        };
        $builder = $this->db->table('pakalpojumi');

        $query   = $builder->get();
---
SELECT *
FROM `pakalpojumi`

    public function setPassword_user($userId){

        if(!$this->checkSession()){
            return redirect()->to('/login');
        };


        $builder = $this->db->table('meistari');
        $query = $builder->where('id', $userId)->get();
---
SELECT *
FROM `meistari`
WHERE `id` = '6'