app/Controllers/Admin.php

    public function index()
    {
        $builder = $this->db->table('pieteikumi');
        $builder->join('meistari', 'meistari.id = pieteikumi.meistara_id');
        $builder->join('pakalpojumi', 'pakalpojumi.id = pieteikumi.pakalpojuma_id');
        $query   = $builder->orderBy('`timestamp`', 'DESC')->get();
---
SELECT *
FROM `pieteikumi`
JOIN `meistari` ON `meistari`.`id` = `pieteikumi`.`meistara_id`
JOIN `pakalpojumi` ON `pakalpojumi`.`id` = `pieteikumi`.`pakalpojuma_id`
ORDER BY `timestamp` DESC