app/Controllers/Home.php

    public function get_services(){
        $builder = $this->db->table('pakalpojumi');
        $query   = $builder->orderBy('pakalpojums', 'ASC')->get();
---
SELECT *
FROM `pakalpojumi`
ORDER BY `pakalpojums` ASC

    public function get_masters($id,$weekDay){
        $builder = $this->db->table("meistari");
        $query   = $builder->where("pakalpojuma_id",$id)->like("pieejamas_dienas",$weekDay)->get();
---
SELECT *
FROM `meistari`
WHERE `pakalpojuma_id` = '5'
AND  `pieejamas_dienas` LIKE '%2%' ESCAPE '!'

    public function get_masters_time($id){
        $builder = $this->db->table("meistari");
        $builder->select('pieejamas_stundas')->where("id",$id);
        $query = $builder->get();
---
SELECT `pieejamas_stundas`
FROM `meistari`
WHERE `id` = '2'

    function putApplication(){
        $builder = $this->db->table("pieteikumi");
        $data = [
            "klienta_vards"=>$this->request->getPost("client_name"),
            "klienta_uzvards"=>$this->request->getPost("client_surname"),
            "klienta_talrunis"=>$this->request->getPost("client_phone"),
            "klienta_epasts"=>$this->request->getPost("client_email"),
            "pakalpojuma_id"=>$this->request->getPost("service_select"),
            "meistara_id"=>$this->request->getPost("master_select"),
            "laiks"=>$this->request->getPost("time_select"),
            "datums"=>$this->request->getPost("service_date"),
        ];
        if($builder->insert($data)){
            $currId = $this->db->insertID();
            $builder = $this->db->table("pieteikumi");
            $builder->join('meistari', 'meistari.id = pieteikumi.meistara_id');
            $builder->join('pakalpojumi', 'pakalpojumi.id = pieteikumi.pakalpojuma_id');
            $query = $builder->where("pieteikumi.id",$currId)->get();
---
INSERT INTO `pieteikumi` (`klienta_vards`, `klienta_uzvards`, `klienta_talrunis`, `klienta_epasts`, `pakalpojuma_id`, `meistara_id`, `laiks`, `datums`) VALUES ('Vitālijs', 'Korabeļlņikovs', '22846289', 'vitaly.music@inbox.lv', '5', '2', '15', '2022-11-19')
SELECT *
FROM `pieteikumi`
JOIN `meistari` ON `meistari`.`id` = `pieteikumi`.`meistara_id`
JOIN `pakalpojumi` ON `pakalpojumi`.`id` = `pieteikumi`.`pakalpojuma_id`
WHERE `pieteikumi`.`id` = 41